## 4.8 	DataFrame列添加和删除

In [1]:
import pandas as pd
import numpy as np

In [4]:
data = {
    'apples': [3, 2, 0, 1], 
    'oranges': [0, 1, 2, 3]
}
df = pd.DataFrame(data, index=['June','Robert','Lily','David'])
df

        apples  oranges
June         3        0
Robert       2        1
Lily         0        2
David        1        3

In [5]:
df['banbanas'] = pd.Series([1, 2, 1, 0], index=['June','Robert','Lily','David'])
df

        apples  oranges  banbanas
June         3        0         1
Robert       2        1         2
Lily         0        2         1
David        1        3         0

In [6]:
del df['banbanas']

In [7]:
df

        apples  oranges
June         3        0
Robert       2        1
Lily         0        2
David        1        3

In [8]:
df.pop('apples')

June      3
Robert    2
Lily      0
David     1
Name: apples, dtype: int64

In [9]:
df

        oranges
June          0
Robert        1
Lily          2
David         3